{
  "meta": {
    "title": "Kim Khanh Luu",
    "description": "Kim Khanh Luu Curriculum Vitae",
    "keywords": "cv, Kim Khanh Luu, curriculum vitae, resume, linkedin"
  },
  "info": {
    "name": "Kim Khanh Luu",
    "location": "Darmstadt, Germany",
    "email": "luukhanh96@gmail.com",
    "github": "https://github.com/kkhanhluu",
    "blog": "https://kkhanhluu.github.io/"
  },
  "summary": [
    "I have more than 5 years of experience in the software industry with extensive experience in building and maintaining large-scale digital products.",
    "I have extensive experience in collaborating with cross-functional teams, including front-end developers, product managers, and QA engineers.",
    "I have a solid cloud experience, having worked with Azure and microsoft certificate: Azure Developer Associate. I'm proficient in containerization with Docker and orchestration using Kubernetes for streamlined development and deployment workflows.",
    "I have extensive knowledge of JavaScript, NodeJS, Java, and related technologies and massive experience in designing scalability, high availability and high-performance back­end systems using Load Balancing, RPC, Caching, Message Queue System."
  ],
  "awards": [
    {
      "year": "2023",
      "detail": "Microsoft Certified: Azure Developer Associate (https://learn.microsoft.com/en-us/users/khanhluu-0122/credentials/5a8b1e01b168ba3f)"
    },
    {
      "year": "2021",
      "detail": "Microsoft Certified: Azure Fundamentals (https://www.credly.com/badges/467878d5-e212-4a41-a910-26dc2958c0f3)"
    }, 
    {
      "year": "2020",
      "detail": "1st Hackcovy hackathon (https://kkhanhluu.github.io/hackathon.pdf)"
    }
  ],
  "history": [
    {
      "title": "Backend engineer",
      "company": "Tamara",
      "time": "July 2023 to present",
      "skills": "Java, RabbitMQ, Testcontainers, Kubernetes, MySQL, OCI, ArgoCD, Kibana, New relic",
      "projects": [
        {
          "name": "Backend engineer",
          "description": "I am responsible for building and maintaining services following microservices architecture, which helps to decouple a monolith codebase",
          "responsibilities": [
            "I worked closely with the team and stakeholders to define tech and organizational debt, gathered requirements from partners.",
            "I was responsible for building a scalability, high availability and high-performance back -end services using Microservices architecture.",
            "I handled designing, estimation, development, code review of all modules of the backend system.",
            "I was responsible for supporting to hire top talent in a high-performance engineering team, crafted a structured and fair interview process and created a diverse candidate pipeline in collaboration with HR and technical recruiters."
          ]
        }
      ]
    },
    {
      "title": "Backend engineer",
      "company": "Strapi",
      "time": "November 2022 to June 2023",
      "skills": "Nodejs, Typescript, Kafka, Docker, Kubernetes, PostgreSQL",
      "projects": [
        {
          "name": "Backend engineer",
          "description": "Developing cloud platform, which helps to deploy, monitor and manage strapi app in a cloud environment.",
          "responsibilities": [
            "I was the core developer of backend team.",
            "I involved in designing, estimation, and development of various modules of the backend system.",
            "I mentored and paired with team members to help them learn new technologies and ship features, I was also the one who usually did research new things and shared it with the team."
          ]
        }
      ]
    },
    {
      "title": "Technical lead",
      "company": "Pawtner",
      "time": "September 2020 to February 2022",
      "skills": "Typescript, NodeJS, React native, ASP.NET, Mongodb, Azure",
      "projects": [
        {
          "name": "Technical lead",
          "description": "I led a tribe of 6 engineers. I am responsible for technical planning, overseeing and make the decision on all aspects of architecture and development.",
          "responsibilities": [
              "I worked closely with the team and stakeholders to define technical debt, gathered requirements from stakeholders and ensuring smooth communication between engineering team and stakeholders",
              "I involved in designing and implementing a scalable backend server for a social platform, which allows adopters to find their favorite friends and pets and adopt the pets",
              "I built an authentication/authorization system for this multiple role platform",
              "I involved in designing and developing real-time features by using websocket and firebase (chat, notification,...)",
              "I was responsible for building and managing Azure cloud infrastructures and CI/CD pipeline.",
              "I was responsible for developing the mobile app with react native and take responsibility for publishing the app to Google store and App store"
          ]
        }
      ]
    },
    {
      "title": "Fullstack developer",
      "company": "Gastromatic",
      "time": "April 2018 to November 2022",
      "skills": "Typescript, NodeJS, ReactJS, Nginx, PostgreSQL, LogStash, Kibana, Github actions, AWS, RabbitMQ, GraphQL, MongoDB, Docker",
      "projects": [
        {
          "name": "Fullstack developer",
          "description": "I was involving in planning and building a scalability, high availability and high-performance back -end services using Microservices architecture",
          "responsibilities": [
            "I involved in planing, designing and implementing a microservices application to help digitalizing the accounting process",
            "I developed own backend services with GraphQL/REST, Node.js, Postgres, Mongodb, Apollo federation, Express,... and integrating external APIs (Hubspot, Easybill,...)",
            "I designed and implemented communication between microservices using RabbitMQ (amqpblib/rascal)",
            "I developed modern, multilingual web app with React, typescript, Apollo client and ant design"
          ]
        }
      ]
    }
  ]
}
